export const Calendar = {
	en: {
		daysOfWeek: [
			['Sunday', 'Sun'],
			['Monday', 'Mon'],
			['Tuesday', 'Tue'],
			['Wednesday', 'Wed'],
			['Thursday', 'Thu'],
			['Friday', 'Fri'],
			['Saturday', 'Sat']
		],
		monthsOfYear: [
			['January', 'Jan'],
			['February', 'Feb'],
			['March', 'Mar'],
			['April', 'Apr'],
			['May', 'May'],
			['June', 'Jun'],
			['July', 'Jul'],
			['August', 'Aug'],
			['September', 'Sep'],
			['October', 'Oct'],
			['November', 'Nov'],
			['December', 'Dec']
		],
		dateFormat: '#{m}-#{d}-#{Y}'
	},
	uk: {
		daysOfWeek: [
			['Неділя', 'Нд'],
			['Понеділок', 'Пн'],
			['Вівторок', 'Вт'],
			['Середа', 'Ср'],
			['Четвер', 'Чт'],
			['П\'ятниця', 'Пт'],
			['Субота', 'Сб']
		],
		monthsOfYear: [
			['Січень', 'Січ'],
			['Лютий', 'Лют'],
			['Березень', 'Бер'],
			['Квітень', 'Кві'],
			['Травень', 'Тра'],
			['Червень', 'Чер'],
			['Липень', 'Лип'],
			['Серпень', 'Сер'],
			['Вересень', 'Вер'],
			['Жовтень', 'Жов'],
			['Листопад', 'Лис'],
			['Грудень', 'Гру']
		],
		dateFormat: '#{F}, #{d} / #{Y} (#{d}.#{m}.#{y})'
	},
	ru: {
		daysOfWeek: [
			['Воскресенье', 'Вс'],
			['Понедельник', 'Пн'],
			['Вторник', 'Вт'],
			['Среда', 'Ср'],
			['Четверг', 'Чт'],
			['Пятница', 'Пт'],
			['Суббота', 'Сб']
		],
		monthsOfYear: [
			['Январь', 'Янв'],
			['Февраль', 'Фев'],
			['Март', 'Мар'],
			['Апрель', 'Апр'],
			['Май', 'Май'],
			['Июнь', 'Июн'],
			['Июль', 'Июл'],
			['Август', 'Авг'],
			['Сентябрь', 'Сен'],
			['Октябрь', 'Окт'],
			['Ноябрь', 'Ноя'],
			['Декабрь', 'Дек']
		],
		dateFormat: '#{F}, #{d} / #{Y} (#{d}.#{m}.#{y})'
	}
};
